{"_path":"/engineering/service-overview","_dir":"engineering","_draft":false,"_partial":false,"_locale":"","title":"Service Overview","description":"Simifinii: Authentication Microservice Design Document","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Simifinii: Authentication Microservice Design Document"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Date"}]},{"type":"text","value":": 2021-11-05"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Project"}]},{"type":"text","value":": Simifinii: Authentication Microservice"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Audience"}]},{"type":"text","value":": Engineering"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Authors"}]},{"type":"text","value":": Srikar, Yoan Yomba"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Emails"}]},{"type":"text","value":": "},{"type":"element","tag":"a","props":{"href":"mailto:yoanyombapro@gmail.com"},"children":[{"type":"text","value":"yoanyombapro@gmail.com"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Reply To"}]},{"type":"text","value":": "},{"type":"element","tag":"a","props":{"href":"mailto:yoanyombapro@gmail.com"},"children":[{"type":"text","value":"yoanyombapro@gmail.com"}]}]},{"type":"element","tag":"h2","props":{"id":"introduction"},"children":[{"type":"text","value":"Introduction"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The primary goal of this service is to serve as the primary means of authentication within the backend system."}]},{"type":"element","tag":"h2","props":{"id":"motivation"},"children":[{"type":"text","value":"Motivation"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Authentication is an extremely important aspect of an any platform due in part to the fact that data protection at the user level must be enforced as well as access level permissions. Authentication however, in a distributed system provides more complexities. In monolithic applications, authentication and authorization can be performed via sessions. However, in a distributed system, since multiple instances of a service can be deployed at one time, enforcing user requests to the originating session instance (sticky sessions) isn’t viable and introduces a ton of operational overhead."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"With this in mind, we at the simifinii aim to implement our authorization scheme via 2 sets of services via json web tokens (JWT). We also make use of a distributed cache for session storage which ensures that we don’t need to maintain stickiness across instances of a server. The authentication framework developed by us consists of 2 service instances. One is a stateful instance which utilizes the open-sourced keratin-authn microservice and interfaces with either a postgres or mysql database.The second instance is a headless authentication service which is stateless and serves as an interface through which the keratin-authn service can be interacted with."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The rest of this design document provides further details pertinent to this implementation."}]},{"type":"element","tag":"h2","props":{"id":"potential-solutions"},"children":[{"type":"text","value":"Potential Solutions"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Proposed above is a solution that utilizes 2 sets of services. One which serves as a stateless headless service and interacts with the keratin authn stateful service via APIs. The reason for this design decision is to first abstract the private and public api’s keratin authn exposes from the context of other consuming services. Without this, all calling services would have to be aware of public and private endpoints as well as properly set headers. Through the headless authentication service, these can automatically be set in requests prior to transit."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The reason we picked the open sourced keratin authn service was partly due to the fact that we needed the service to completely own all account credential data completely removing this necessity from other microservices. Additionally we loved its reliance on SQL databases for long term account/credentials data, and its ease of integration into our backend system."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In summary, the API that the authentication handler service provides and its ability to interface with keratin-authn eases the operational overhead all consuming services must absorb."}]},{"type":"element","tag":"h3","props":{"id":"experimental-implement-after-mvp-launch"},"children":[{"type":"text","value":"(EXPERIMENTAL : Implement After MVP Launch)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"It is important to note one very important point. The headless authentication service withholds a go-routine which continuously polls the message queue’s “record update” channel. The messages in such queues follow the following rubric. They must contain the name of the respective grpc api and the required request field parameters. The go-routine routinely polls the message queue, performs the operation defined by the message via a set of retries and on failures (internal server error) … puts the message back onto the queue."}]},{"type":"element","tag":"h2","props":{"id":"assumptions"},"children":[{"type":"text","value":"Assumptions"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"No assumptions are currently present. However, this section is prone to change especially as the service level requirements change."}]},{"type":"element","tag":"h2","props":{"id":"constraintslimitations"},"children":[{"type":"text","value":"Constraints/Limitations"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"These sets of services are only meant to provide an authentication mechanism and retain a single source of truth of the state of an account throughout the backend system. Account state updates must propagate to this service via distributed transactions. Consistency holds the highest priority when dealing with account record state within the system.\nSystem Design/Architecture\nSystem Diagram & Flowchart"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"image info","src":"./images/auth_hdlr_svc.png"},"children":[]},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Figure 1: Authentication Handler Service"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"image info","src":"./images/auth_svc.png"},"children":[]},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Figure 2: Authentication Service (Keratin Authn)"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"image info","src":"./images/svc_level_interactions.png"},"children":[]},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Figure 3: Service Level Interactions"}]}]},{"type":"element","tag":"h2","props":{"id":"hard-soft-requirements"},"children":[{"type":"text","value":"Hard & Soft Requirements"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This is a crucial part of the system. As a result, if either instance goes down, users will inherently be unable to sign into the system, create new accounts, and account records could be in an inconsistent state across the backend. In summary, this would cause an outage."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Since consistency is key to ensuring the system behaves as expected, we must build in resiliency through asynchronous messaging in hopes of enabling failed requests to eventually be processed (eventual consistency). This concept of eventual consistency if truly only relevant for failed requests attempting to modify account record states. In cases of failed sign up/sign in requests due to service unavailability, we must provide the proper alert logic (sev 1 … etc) so that the on-call can fix the problem at hand."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"It is important to note that we prioritize data consistency across the backend since lack thereof can have serious implications. Lack of access to the system as a result of complete failure for us although ill-advised can be rectified assuming the on-call tends to the failure in a timely manner. This however entails that granular logs are emitted, the proper set of metrics are defined, critical logic paths are instrumented, and proper monitoring is set in place."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Remember, there is no such thing as “over instrumentation”."}]},{"type":"element","tag":"h2","props":{"id":"algorithm-pseudocode-for-main-components"},"children":[{"type":"text","value":"Algorithm & Pseudocode For Main Components"}]},{"type":"element","tag":"h3","props":{"id":"authentication"},"children":[{"type":"text","value":"Authentication"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The authentication scheme makes use of JWT tokens for authentication. In order for a user to be properly authenticated, he/she must first create an account then go through the account sign up flow. From the context of the frontend, the registration flow varies across user types. However, in the context of the backend, all accounts have similar registration flow and exact sign up flow."}]},{"type":"element","tag":"h3","props":{"id":"registration"},"children":[{"type":"text","value":"Registration"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Registration is a multi-step process that begins at the client and involves a multitude of services. The below step outline this process"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Through a form on the frontend, we collect a user’s credentials and other required pieces of data & perform field validation"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Send the request to the Api-Gateway\n"},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Api-Gateway obtains from the request object the email and password fields and performs a series of calls to the headless authentication\nservice. The first endpoint called is the “password score” to ensure the request password is strong enough.\n"},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"On failure, we return an error to the client stating the provided password is too weak."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"On success, we proceed to the next call"}]}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Api-Gateway invokes the “create account” api of the authentication handler service.\n"},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Headless Authentication service performs a create account call via the authentication service and returns the id of the created account to\nthe Api-Gateway."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"On failure, we return an error to the client stating that the provided credentials are invalid or there is an outage."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"On success, we perform the next set of operations"}]}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"With the returned ID, the Api-Gateway calls a set of backend services explicitly or through msg queues to create records from their context\nand any additional operation such as sending out email, … etc.\n"},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"If this fails, the gateway needs to be smart about retrying this operation. ensuring fields are properly validated before the request is\nsent from the frontend to the gateway can limit this from happening."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"NOTE: these set of operations should be performed asynchronously via messages and a queue"}]}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Upon successful creation of the account, we send the successful response to the frontend"}]}]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The only difference between the set of service level interactions in the backend between merchant and shopper registration is the manner in which services interact upon a successful response is obtained from the authentication handler service after the “create account” call."}]},{"type":"element","tag":"h3","props":{"id":"login"},"children":[{"type":"text","value":"Login"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"When a user logs in, they establish two sessions: one with the frontend which expires periodically, and another with the backend that can be used to refresh the app session. These are called the access token and refresh token, respectively."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"During login, the backend works to ensure that users may not enumerate users in your system. This means it will not declare which field was incorrect , but instead fails with a generic credentials error. The below set of steps outline the process by which this logic flow is carried out."}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Through a form in the frontend, we collect user credentials and validate all fields"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Send the information to the Api-Gateway\n"},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Api-Gateway calls the authentication handler service via the “login” grpc endpoint which calls the authentication service to ensure it\nwithholds the record of interest\n"},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"On failure, we return an error to the frontend immediately"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"On success, we obtain a JWT token and perform the following set of operations"}]}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"We condition on account type and call a set of backend services to create a response that is\nnecessary for the ensuing UI page that follows successful logins\n"},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"NOTE: Because we will be calling numerous services and schema stitch their responses, we are ok with partial failures. However, we must\nensure we provide the proper retry logic in place in cases of failure and emit the right set of metrics."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"On failure of all calls, we should raise a sev 1 incident and return an error to the client"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"On success, we return the data to the frontend."}]}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Frontend obtains positive response from Api-Gateway and stores the JWT token in the browser cache which it can leverage on ensuing requests\nby placing the token in the request header"}]}]}]}]},{"type":"element","tag":"h3","props":{"id":"logout"},"children":[{"type":"text","value":"Logout"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Most of our users will probably disappear when they close the application, but sometimes they will want to cleanly log out. The backend will take care of cleaning up its sessions (the access token and refresh token). The below set of steps outline out log out flow."}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"The Api-Gateway is called with the current user’s account id when a user clicks the logout button."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Api-Gateway by use of the account ID calls the headless authentication service via the “logout” grpc endpoint which invoked the “logout” http\nendpoint of the keratin-authn microservice.\n"},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"On success, the token within the session established with the backend for the account is revoked and the session is terminated."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"On failure, we emit metrics, and continue to the next set of calls"}]}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Api-Gateway call any other cleanup operations against the APIs of other microservices\n"},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"NOTE: perform this via message queues. Asynchronous operation is useful in this scenario"}]}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Api-Gateway returns a success response to the frontend"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Frontend removes the JWT token from browser cache."}]}]},{"type":"element","tag":"h3","props":{"id":"password-resetchange"},"children":[{"type":"text","value":"Password Reset/Change"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The password registration process is a 2 phased endeavor. It requires the account owner to first request a password which will result in the account owner obtaining an email with a link to a password reset page where the password will be reset"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Through a form on the frontend, a user will provide their email field which will be validated prior to the Api-Gateway being invoked"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Api-Gateway obtains the email field from the request body and call the headless authentication service via the “password reset” grpc endpoint\n"},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Headless Authentication service invokes the “/password/reset” http endpoint of the authentication service.\n"},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Authentication service will post a webhook to the application password reset url with a request body containing the account ID and the\ngenerated jwt token.\n"},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"NOTE: This webhook should be the url of the email service which would send an email containing the data to the user’s email and a\nlink to a custom password reset form. APP_PASSWORD_RESET_URL environment variable must be set"}]}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Authentication service will return a response code which will tell the Api-Gateway whether an error occurred or not."}]}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Response code is used to send message to the frontend"}]}]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In the second phase, once the user obtains the password reset email and clicks on the link forwarding him/her to the password reset form, we perform the following set of operations."}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Through the frontend, the user inputs his/her new password. Fields are validated and then a request is sent to the Api-Gateway. Prior to the\nrequest being sent, the JWT token which was sent to the user’s email is attached to the request header"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Api-Gateway calls the authentication handler service’s “password score” grpc endpoint first.\n"},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"On failure, re-prompt the user to input a stronger password"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"On success, perform the next set of operations"}]}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Api-Gateway invokes “update account password” grpc endpoint which calls the authentication service via “/password” http endpoint with the new\npassword and the JWT token.\n"},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"On failure, return the error message to the client"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"On success, perform the next set of operations"}]}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Api-Gateway calls and updates other dependent services that must be aware of the new password such as sending a confirmation email that the\npassword was successfully changed, … etc and returns the status of the prior operation to the frontend.\n"},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"NOTE: these set of service level interactions should ideally be performed via message queue."}]}]}]}]},{"type":"element","tag":"h3","props":{"id":"record-update"},"children":[{"type":"text","value":"Record Update"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Account record modifications are expected and must occur in a fault-tolerant manner. The below set of steps outline the steps set in place in order to mitigate inconsistencies throughout the backend on operation failures especially since the state of the record present in the authentication service (keratin-authn) is the single source of truth."}]},{"type":"element","tag":"h4","props":{"id":"operations"},"children":[{"type":"text","value":"Operations"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Any operation which updates the state of an account record (lock/unlock, update, archive,...etc) may fail and as a result we must ensure the proper limitations are set in place."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Whenever a record state update is attempted through the invocation of a respective grpc endpoint, the calling service must first perform the call and check the response. The following options are available to the caller depending on the status of the operation"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Failure\n"},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"On failure (after numerous retries and internal server error), the calling service has 2 choices.\n"},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Either the calling service fails the current overarching operation entirely"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"In cases when eventual consistency is acceptable, the calling service can place a message on the “update channel” of the message queue\nwhich the authentication handler service is subscribed to and is to handle at some point later on."}]}]}]}]}]}]},{"type":"element","tag":"h2","props":{"id":"sla-service-guarantees"},"children":[{"type":"text","value":"SLA & Service Guarantees"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Fault tolerance and recovery requirements are defined above."}]},{"type":"element","tag":"h2","props":{"id":"data-definition-schema-design-persistence-requirements"},"children":[{"type":"text","value":"Data Definition, Schema Design, Persistence Requirements"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The data model is currently very simple. The authentication service (keratin-authn) only stores the following fields"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Record ID"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Username/Email"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Password"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Locked (Tells whether the account is locked)"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Deleted (Tells whether the account has been archived)"}]}]},{"type":"element","tag":"h2","props":{"id":"caching-requirements"},"children":[{"type":"text","value":"Caching Requirements"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Currently, there are no caching requirements as the headless authentication service is stateless and the authentication handler service only makes use of a key value store for session storage."}]},{"type":"element","tag":"h2","props":{"id":"capacity-planning"},"children":[{"type":"text","value":"Capacity Planning"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Both services will generate logs, metrics, and traces. However, there isn’t an expectation that the service will generate an abnormal amount of data. We will leverage datadog as our metrics, log, and trace store. The retention policy will be 1 month."}]},{"type":"element","tag":"h2","props":{"id":"performance-requirements"},"children":[{"type":"text","value":"Performance Requirements"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Authentication Handler Service & Authentication Service (keratin-authn)"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Expected throughput: 50K QPS"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Expected Latencies: < 9ms"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In order to ensure we have the utmost throughput and the minimal service level latencies, we following points must be enforced throughout development.\nA gRPC channel must be reused when making gRPC calls since this allows calls to be multiplexed through an existing HTTP/2 connection. If a new channel is created for each gRPC call then we can have a significant latency overhead since each call will require multiple round trips between the client and the server to create the HTTP/2 connection:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Opening a socket"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Establishing TCP connection"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Negotiating TLS"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Starting HTTP/2 Connection"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Making The gRPC call."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Channels on the contrary are safe to share and reuse between gRPC calls since gRPC clients are created with channels, are lightweight and don't require much caching. Multiple gRPC clients can be generated from a channel and such channels and clients can be used by multiple threads."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Please reference grpc performance best practices throughout development to optimize performance."}]},{"type":"element","tag":"h2","props":{"id":"security"},"children":[{"type":"text","value":"Security"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The authentication scheme makes use of emails which is considered personally identifiable information (PII/PCI). As a result, security is crucial. The proper origin headers must be set which is enforced by the keratin-authn service as well as communication via https. To further enhance security, all API traffic must be encrypted with TLS and SSL internally."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Please reference security best practices throughout development to better secure the backend system."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"##Multi Region Story\nAs of yet, there are no regional special requirements for this service."}]},{"type":"element","tag":"h2","props":{"id":"apigrpc-endpoints"},"children":[{"type":"text","value":"API/gRPC Endpoints"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Please reference the grpc endpoint documentation throughout development."}]},{"type":"element","tag":"h2","props":{"id":"rollout-plan"},"children":[{"type":"text","value":"Rollout Plan"}]},{"type":"element","tag":"h3","props":{"id":"rollout-phases"},"children":[{"type":"text","value":"Rollout Phases"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Rollout phases will be determined later.\nA/B Tests\nA/B Tests will be determined later."}]},{"type":"element","tag":"h3","props":{"id":"data-migration"},"children":[{"type":"text","value":"Data Migration"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"No data migration should occur however in the context of the authentication service, schema migrations should occur."}]},{"type":"element","tag":"h2","props":{"id":"test-plan"},"children":[{"type":"text","value":"Test Plan"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Testing is crucial and will be prioritized throughout development. Unit tests will be of high importance. We mandata that each service has at least 85% unit test coverage. As for testing dependencies through integration and load tests, we will perform this in four phases."}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Phase 1: mock dependency response & test logic"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Phase 2: spin up dependencies in docker containers & perform gCurl against grpc endpoints & ensure expected response is obtained"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Phase 3: spin up dependencies in local & sandboxed kubernetes cluster & perform gCurl against grpc endpoints & ensure expected response is obtained."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Phase 4: through use of vegeta load testing tool we will perform load tests against services running in kubernetes sandbox environment"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The final stage of testing will apply chaos testing. We will enable certain environment variables which will fail some requests based on some preset probability. With this, we will perform load tests once again and ensure the proper set of metrics are emitted and the service is behaving as expected."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"NOTE"}]},{"type":"text","value":": it is important all these can be performed both locally and within our CI/CD workflow."}]},{"type":"element","tag":"h2","props":{"id":"appendix"},"children":[{"type":"text","value":"Appendix"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"SSL & TLS Examples"}]},{"type":"element","tag":"h2","props":{"id":"review-sign-off"},"children":[{"type":"text","value":"Review Sign-Off"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Team Lead/Manager - sign off by Srikar, Yoan Yomba\nSponsor - sign off by Yoan Yomba"}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"introduction","depth":2,"text":"Introduction"},{"id":"motivation","depth":2,"text":"Motivation"},{"id":"potential-solutions","depth":2,"text":"Potential Solutions","children":[{"id":"experimental-implement-after-mvp-launch","depth":3,"text":"(EXPERIMENTAL : Implement After MVP Launch)"}]},{"id":"assumptions","depth":2,"text":"Assumptions"},{"id":"constraintslimitations","depth":2,"text":"Constraints/Limitations"},{"id":"hard-soft-requirements","depth":2,"text":"Hard & Soft Requirements"},{"id":"algorithm-pseudocode-for-main-components","depth":2,"text":"Algorithm & Pseudocode For Main Components","children":[{"id":"authentication","depth":3,"text":"Authentication"},{"id":"registration","depth":3,"text":"Registration"},{"id":"login","depth":3,"text":"Login"},{"id":"logout","depth":3,"text":"Logout"},{"id":"password-resetchange","depth":3,"text":"Password Reset/Change"},{"id":"record-update","depth":3,"text":"Record Update"}]},{"id":"sla-service-guarantees","depth":2,"text":"SLA & Service Guarantees"},{"id":"data-definition-schema-design-persistence-requirements","depth":2,"text":"Data Definition, Schema Design, Persistence Requirements"},{"id":"caching-requirements","depth":2,"text":"Caching Requirements"},{"id":"capacity-planning","depth":2,"text":"Capacity Planning"},{"id":"performance-requirements","depth":2,"text":"Performance Requirements"},{"id":"security","depth":2,"text":"Security"},{"id":"apigrpc-endpoints","depth":2,"text":"API/gRPC Endpoints"},{"id":"rollout-plan","depth":2,"text":"Rollout Plan","children":[{"id":"rollout-phases","depth":3,"text":"Rollout Phases"},{"id":"data-migration","depth":3,"text":"Data Migration"}]},{"id":"test-plan","depth":2,"text":"Test Plan"},{"id":"appendix","depth":2,"text":"Appendix"},{"id":"review-sign-off","depth":2,"text":"Review Sign-Off"}]}},"_type":"markdown","_id":"content:3.engineering:service-overview.md","_source":"content","_file":"3.engineering/service-overview.md","_extension":"md"}